[

][
{"name": "Go Digital and Deliver a Superior Experience", "url": "https://www.shl.com/products/assessments/assessment-and-development-centers/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n \n SHL’s end-to-end digital assessment and development centers are the most efficient and accurate way of identifying potential. Our team of 300 people scientists operate in 150 countries, speak over 40 languages, and provide 24-hour support. Effortlessly organize and run your centers with a digital platform that delights participants with interactive media and a clear and engaging end-to-end process. The world’s broadest range of skills, psychometric, personality, and cognitive assessments empower people to show their potential with simulations, group exercises, client meetings, and more. Increase the speed of hiring and development decisions with automated reports and dashboards powered by unrivaled people science. Reduced time-to-hire by 60% across multiple global organizations. SHL's customer shortened time-to-assess for 500 global managers by 75%. 89% of candidates rated SHL’s digital interview experience as \"excellent.\" \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Virtual Assessment and Development Centers | SHL"},
{"name": "SHL Personality and Ability Assessment Course", "url": "https://www.shl.com/solutions/services/training-services/personality-and-ability-assessment-training/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n \n We offer a wide range of courses designed to support HR professionals. \n Pre-Course Activities The online materials contain background information and industry best practices that will lay the foundation for your learning. Live Class Learning The live class takes place over the course of two days and includes theory and case study exercises that bring your learning to life. Post-Course Support Access to the OPQ, eLearning, workshops and support tools help boost your understanding and confidence in administering the OPQ. Our new virtual course, designed as an engaging, interactive experience for every participant, has the same components as our regular in-company and public courses, distilled into key concepts and supplemented by additional contemporary perspectives.   In-company courses gather stakeholders together to focus on assessment strategy, psychometric testing policy, and industry developments. These customizable sessions are delivered in your choice of venue. (Note: Many live courses have gone virtual during the pandemic.)  Public courses offer great opportunities to network with peers and share knowledge and perspective with others outside your organization. See our training calendar for public courses near you. (Note: Many live courses have gone virtual during the pandemic.)  \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Personality and Ability Assessment Course | SHL"},
{"name": "AI-powered Language Proficiency Tests", "url": "https://www.shl.com/products/assessments/skills-and-simulations/language-evaluation/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Skills & Simulations \n Accelerate your hiring process with SHL's AI-driven suite of communication and language tests, streamlining language assessment to swiftly identify and onboard candidates who excel at customer satisfaction. Candidates undergo an assessment to demonstrate their spoken language proficiency, which can be taken via mobile, desktop, or Interactive Voice Response System [IVR]. We auto-evaluate written communication for content quality, grammar, and etiquette. Comprehensive reports are provided, containing scores, linguistic errors, and CEFR level scores for each candidate. SHL recommended candidates were 63% more likely to be high performers. Reduce candidate wait time by 55% with automated evaluation and quick feedback. Evaluate candidates at scale and reduce time to hire by 60%. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Language Proficiency Test | Language Assessment | SHL"},
{"name": "Technical Skill Assessment | Assess Technical Knowledge | SHL", "url": "https://www.shl.com/products/assessments/skills-and-simulations/technical-skills/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n Programming simulation for machine learning, data science, and data engineering roles. Applied tests for Hadoop, Spark, Tableau, MongoDB, and more. Assess a candidate’s ability to work on front-end, backend, and database technologies such as HTML/CSS, JavaScript, jQuery, AngularJS, MySQL, PHP, and more. Tests of cloud computing, various cloud service models, virtualization, and private clouds. A compiler-integrated platform that evaluates coding skills of developers as they write, compile, and execute the code in real-time. Applied assessment of DBMS and languages, such as SQL, MySQL, SQL Server, and PL/SQL Test of skills to manage technology deployment and monitoring using cloud technologies, web services, systems, and network management. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Technical Skill Assessment | Assess Technical Knowledge | SHL"},
{"name": "SHL Coding Skills Assessment and Simulations", "url": "https://www.shl.com/products/assessments/skills-and-simulations/coding-simulations/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Skills & Simulations \n SHL Coding Simulations help reduce false negatives by 45% and improve hiring signals across programming ability, solution logic, time complexity, and industry-accepted best practices. \n   SHL's online coding tests allow applicants to solve real-life problems by running and testing their own source code in our IDE. The coding skills assessment scores the logic of each candidate’s code using a benchmark dataset. Teams receive scores and detailed reports, advancing capable software engineers to the next stage. Recruiters use Smart Interview Live Coding to conduct interviews with qualified candidates. They utilize our question bank to identify relevant questions and tests for the role. Strengthen your workforce by converting diverse, top-quality graduates with meaningful hiring experiences, fair assessment tools and unrivalled science. Reboot your technology hiring process to draw in top-quality developers through immersive experiences and AI-powered virtual hiring tools. Help new and mid-level managers build leadership skills that boost team engagement and drive business results. Drive smarter talent mobility, succession planning, HIPO identification, and workforce development decisions with actionable talent insights. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Coding Simulations | Coding Skills Assessment | SHL"},
{"name": "Business Skills Assessment Tests for Deep Insights", "url": "https://www.shl.com/products/assessments/skills-and-simulations/business-skills/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Skills & Simulations \n Our world-leading portfolio of business assessment tools engages your candidates with real-world simulations and science-backed questions covering everything from personality and motivation to specific business skills. Our business assessments use simulations to measure each candidate’s proficiency in using key productivity tools across the Microsoft suite. Utilize our online computer literacy test for hiring candidates who can prove their fundamental computer skills in a simulated Microsoft Windows environment. Assess candidate’s ability to manage workbooks, analyze and format data, work across multiple tabs or spreadsheets, print correctly, and more. Assess candidate’s ability to organize and format content, manage documents, work with page illustrations and layouts, and more. Assess candidate’s ability to manage contacts, demonstrate email efficiency, create appointments through the Outlook calendar, and more. Assess candidate’s ability to create and format professional presentations, work with graphics and charts, embed and manipulate multimedia elements, and more. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Business Skills Assessment Test | Computer Literacy Test | SHL"},
{"name": "Assess Agents in a Real Contact Center Environment", "url": "https://www.shl.com/products/assessments/skills-and-simulations/call-center-simulations/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Skills & Simulations \n SHL Insights SHL reduced the hiring of agents with a First Call Rate (FCR) below an acceptable threshold for one customer by 65%. We also helped them increase CSAT score by 32% by identifying highly skilled customer service representatives. SHL Contact Center simulations are proven to help reduce time to hire by over 60%. \n Candidates immerse themselves in the role of a contact center agent, either listening to a simulated call or interacting with a chat simulation, to help customers using a realistic contact center system. Measure critical customer service skills including: Choose our ready-to-deploy simulations available for multiple roles. Contact Center job simulations are available for multiple industries, such as: Choose to tailor one for your industry and needs. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Virtual Call Center Simulation and Assessment Software | SHL"},
{"name": "Skills Assessment Test | Skills Assessment Tool | SHL", "url": "https://www.shl.com/products/assessments/skills-and-simulations/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n   SHL’s market-leading portfolio provides far-ranging breadth across roles and industries. Comprehensively evaluate technical concepts, knowledge, and application, covering 200+ specific IT skills. Assess your tech candidates with AI-powered online coding simulations that measure accuracy and logical correctness, and more. Build a strong, multilingual workforce with reliable, AI-powered language assessments. Pressure-test agents for success with job simulations that emulate a real call center environment. Assess candidates for the essential business skills and computer literacy that enterprise teams need today. SHL’s skills and job simulations portfolio contains hundreds of assessments spanning many roles across major industries like engineering, healthcare, and clerical. \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Watch Now\n\n \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Skills Assessment Test | Skills Assessment Tool | SHL"},
{"name": "SHL Personality Assessments", "url": "https://www.shl.com/products/assessments/personality-assessment/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n Improve hiring with science-backed personality tests that reveal each candidate’s preferences, motivations, and remote-work capability. Align individual working preferences to business requirements, and produce accurate, fair assessments of each worker’s potential. Match each individual’s personal motivation to your team and organizational goals, so you can build an engaged, high-performing workforce. What You Need to Know About SHL’s Personality Assessments You can use the OPQ, MQ and RWQ at any stage of the candidate journey, whether you are recruiting, developing or just want to better understand your workforce. All our psychometric tests are designed with engaging, mobile-first technology, so candidates can easily initiate and complete them from anywhere and at any time. SHL’s personality assessments offer a wide variety of automated reports, for both participants and managers, that are easy to read and understand. Our personality assessments allow users to make color-contrast amendments, and there is guidance available for any candidates who may require or desire additional accessibility options. All our psychometric tests are administered online. There is also an option to enable our remote proctoring capability, to administer the assessments within a virtually supervised environment. \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Personality Assessment Test For Hiring | SHL"},
{"name": "Behavioral Assessment Tools | Behavior Assessment Tests | SHL", "url": "https://www.shl.com/products/assessments/behavioral-assessments/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n SHL’s realistic job previews and situational judgement tests give candidates engaging previews of the role at hand, while helping you to sift the applicant pool for best-fit applicants at scale. Our behavioral assessments reduce the risk of assessing candidates who may not be a role or cultural fit, saving your recruitment teams time and money. SHL showcases your opportunities by packing each hiring experience with animation, interactive videos, and branded multimedia, built by you or by us to keep candidates engaged. Preview roles with scenario-based quizzes that give candidates a feel for what the job would be like before they commit to applying. Match a candidate’s behavioral fit to your role with immersive, interactive scenarios and effective screening at scale. Get a rational, consistent, and practical understanding of people’s behaviors at work and if they can succeed in the role. You can use our behavioral assessments to introduce candidates to your organization and discover their fit, which often happens at the start of the hiring process. All our Behavioral Assessments are designed with mobile-first technology to enable candidates to easily complete them anywhere, at any time, on any device. SHL uses a match score to provide you with an overview of how a candidate will perform in a specific role. \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Watch Now\n\n \n                                             \n                                         \n    Read More\n\n \n                                             \n                                         \n    Read More\n\n \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Behavioral Assessment Tools | Behavior Assessment Tests | SHL"},
{"name": "ADO.NET (New)", "url": "https://www.shl.com/products/product-catalog/view/ado-net-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge on the concepts of ADO.NET architecture, components and data provider objects. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 10 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "ADO.NET (New) | SHL"},
{"name": "Accounts Receivable Simulation (New)", "url": "https://www.shl.com/products/product-catalog/view/accounts-receivable-simulation-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Simulated data entry test that measures the ability to process receivables and invoices. Entry-Level, Graduate, Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 8 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Accounts Receivable Simulation (New) | SHL"},
{"name": "Accounts Receivable (New)", "url": "https://www.shl.com/products/product-catalog/view/accounts-receivable-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multiple-choice test that measures the knowledge of processing receivables and invoices. Entry-Level, Graduate, Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 13 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Accounts Receivable (New) | SHL"},
{"name": "Accounts Payable Simulation (New)", "url": "https://www.shl.com/products/product-catalog/view/accounts-payable-simulation-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Simulated data entry test that measures the ability to process payables and vendor invoices. Entry-Level, Graduate, Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 8 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Accounts Payable Simulation (New) | SHL"},
{"name": "Accounts Payable (New)", "url": "https://www.shl.com/products/product-catalog/view/accounts-payable-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multiple-choice test that measures the knowledge of processing payables and vendor invoices, and the posting of journal entries. Entry-Level, Graduate, Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 9 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Accounts Payable (New) | SHL"},
{"name": ".NET XAML (New)", "url": "https://www.shl.com/products/product-catalog/view/net-xaml-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge of XAML triggers, data binding, custom controls and layouts. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 5 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET XAML (New) | SHL"},
{"name": ".NET WPF (New)", "url": "https://www.shl.com/products/product-catalog/view/net-wpf-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge of .NET basics, WPF, XAML controls, events, layouts, working with WPF windows/menus and deploying WPF applications. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 9 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET WPF (New) | SHL"},
{"name": ".NET WCF (New)", "url": "https://www.shl.com/products/product-catalog/view/net-wcf-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge of .NET fundamentals, WCF architecture, programming model, SOA, managing and programming WCF. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 11 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET WCF (New) | SHL"},
{"name": ".NET MVVM (New)", "url": "https://www.shl.com/products/product-catalog/view/net-mvvm-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge of MVVM pattern, scenarios, data validation, ViewModel communication and Quick-start. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 5 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET MVVM (New) | SHL"},
{"name": ".NET MVC (New)", "url": "https://www.shl.com/products/product-catalog/view/net-mvc-new/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Multi-choice test that measures the knowledge of Model-View-Controller (MVC) architecture, validation, security, routing, and areas. Mid-Professional, Professional Individual Contributor,  English (USA),  Approximate Completion Time in minutes = 17 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET MVC (New) | SHL"},
{"name": ".NET Framework 4.5", "url": "https://www.shl.com/products/product-catalog/view/net-framework-4-5/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The.NET Framework 4.5 test measures knowledge of .NET environment. Designed for experienced users, this test covers the following topics: Application Development, Application Foundation, Data Modeling, Deployment, Diagnostics, Performance, Portability, and Security. Professional Individual Contributor, Mid-Professional,  English (USA),  Approximate Completion Time in minutes = 30 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": ".NET Framework 4.5 | SHL"},
{"name": "Global Skills Development Report", "url": "https://www.shl.com/products/product-catalog/view/global-skills-development-report/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. This report is designed to be given to individuals who have completed the Global Skills Assessment (GSA). With coverage across the Great 8 Domains, this measure of self-reported behaviors offers a complete overview of their current skills. Participants receive actionable tips on leveraging their top skill strengths and how they might develop their growth skills.\r\n Director, Entry-Level, Executive, General Population, Graduate, Manager, Mid-Professional, Front Line Manager, Supervisor,  \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             English (USA) \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Global Skills Development Report  | SHL"},
{"name": "Cashier Solution", "url": "https://www.shl.com/products/product-catalog/view/cashier-solution/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Cashier solution is for entry-level retail positions in which employees receive payment in the form of cash, check, or credit cards for goods purchased. Sample tasks for these jobs include, but are not limited to: handling payments, offering customer service, and issuing receipts and refunds. Potential job titles that use this solution are: Cashier, Sales Associate, and Clerk. There are multiple configurations and versions of this solution available. Entry-Level,  English (USA),  Approximate Completion Time in minutes = 28 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Cashier Solution | SHL"},
{"name": "Branch Manager - Short Form", "url": "https://www.shl.com/products/product-catalog/view/branch-manager-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. This solution is for mid to upper-level financial institution managerial positions. Candidates answer a series of multiple choice questions to measure management potential, management judgment, leadership potential, team management, branch manager problem solving, business leadership, leadership motivation, interpersonal leadership, self leadership, and branch manager judgment. There are multiple configurations and versions of this solution available. Front Line Manager, Manager, Supervisor,  English (USA),  Approximate Completion Time in minutes = 50 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Branch Manager - Short Form | SHL"},
{"name": "Bookkeeping, Accounting, Auditing Clerk Short Form", "url": "https://www.shl.com/products/product-catalog/view/bookkeeping-accounting-auditing-clerk-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Bookkeeping, Accounting, and Auditing Clerk solution is for entry-level positions that involve entering numerical data into computer systems and maintaining financial records. Sample tasks for this job include, but are not limited to: entering financial data into computers; checking financial records for accuracy; perform routine computations on financial data. Potential job titles that use this solution are: Accounting Clerk, Bookkeeper, Accounting Associate, Auditing Clerk and Accounts Receivable Clerk. Entry-Level,  English (USA),  Approximate Completion Time in minutes = 49 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Bookkeeping, Accounting, Auditing Clerk Short Form | SHL"},
{"name": "Bilingual Spanish Reservation Agent Solution", "url": "https://www.shl.com/products/product-catalog/view/bilingual-spanish-reservation-agent-solution/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Bilingual Reservation Agent solution is designed for customer centered entry-level positions within the hospitality industry. Sample tasks may include making, updating, or canceling hotel reservations made in English or Spanish; listening to customers speak Spanish and entering information into a computer in English; providing information on the hotel and the services offered. Potential job titles that use this solution are: Bilingual Reservation Agent, Customer Service Representative and Reservationist. Multiple configurations of this solution are available. Entry-Level,  English (USA), Latin American Spanish,  Approximate Completion Time in minutes = 43 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Bilingual Spanish Reservation Agent Solution | SHL"},
{"name": "Bank Operations Supervisor - Short Form", "url": "https://www.shl.com/products/product-catalog/view/bank-operations-supervisor-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Bank Operations Supervisor solution is for job candidates applying to entry-level leadership positions who tend to supervise hourly employees. Sample tasks for these jobs include, but are not limited to:  planning and preparing work schedules, assigning employees to specific duties; coaching  employees on attendance, conduct, schedule adherence, and work tasks, developing employees' skills ; training subordinates; prioritizing multiple tasks  and priorities; and making  day-to-day decisions with minimal guidance from others. Potential job titles that use this solution are: Team Leader, First Line Supervisor, Processing Supervisor, Call Center Supervisor, and Customer Service Supervisor. There are multiple configurations and versions of this solution available. Front Line Manager, Manager, Supervisor,  English (USA),  Approximate Completion Time in minutes = 45 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Bank Operations Supervisor - Short Form | SHL"},
{"name": "Bank Collections Agent - Short Form", "url": "https://www.shl.com/products/product-catalog/view/bank-collections-agent-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. This solution is for entry-level collections positions in an inbound or outbound call center environment in a financial setting. Candidates answer multiple choice questions to measure achievement orientation, dependability, collector numerical skills, revenue recovery, customer focus, and persistence and planfulness. There are multiple configurations and versions of this solution available. Entry-Level,  English (USA),  Approximate Completion Time in minutes = 45 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Bank Collections Agent - Short Form | SHL"},
{"name": "Bank Administrative Assistant - Short Form", "url": "https://www.shl.com/products/product-catalog/view/bank-administrative-assistant-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Administrative Assistant solution is for entry-level clerical positions that interact with external or internal customers. Sample tasks for these jobs include, but are not limited to: answering telephones, managing files and records, sorting mail, greeting customers, and collaborating with co-workers on projects. Potential job titles that use this solution are: Receptionist and Administrative Assistant. There are multiple configurations of this solution available. Entry-Level,  English (USA),  Approximate Completion Time in minutes = 35 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Bank Administrative Assistant - Short Form | SHL"},
{"name": "Apprentice 8.0 Job Focused Assessment", "url": "https://www.shl.com/products/product-catalog/view/apprentice-8-0-job-focused-assessment/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Apprentice 8.0 Job-Focused Assessment is a short, targeted, globally applicable assessment. This assessment is designed for entry-level positions appropriate for countries and industries that use an apprenticeship model. It is intended to be used multi-nationally for organizations whose business spans across regions. Entry-Level, General Population, Graduate,  English International, German, French,  Approximate Completion Time in minutes = 20 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             German \n                                                 \n                                             German \n                                                 \n                                             German \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Apprentice 8.0 Job Focused Assessment | SHL"},
{"name": "Apprentice + 8.0 Job Focused Assessment", "url": "https://www.shl.com/products/product-catalog/view/apprentice-8-0-job-focused-assessment-4261/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Apprentice + 8.0 Job-Focused Assessment is a short, targeted, globally applicable assessment which includes a short cognitive ability measure. This assessment is designed for entry-level positions appropriate for countries and industries that use an apprenticeship model. It is intended to be used multi-nationally for organisations whose business spans across regions. General Population, Graduate, Entry-Level,  English International, German,  Approximate Completion Time in minutes = 30 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             English International \n                                                 \n                                             German \n                                                 \n                                             German \n                                                 \n                                             German \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Apprentice + 8.0 Job Focused Assessment | SHL"},
{"name": "Agency Manager Solution", "url": "https://www.shl.com/products/product-catalog/view/agency-manager-solution/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Agency Manager solution is for mid-level sales management positions that include front line management and sales responsibilities. Sample tasks for this job include, but are not limited to: directing and coordinating financial activities of workers in a branch, office, or department of an establishment, such as branch bank, brokerage firm, risk and insurance department, or credit department.  Potential job titles that use this solution are: Agency Manager, Brokerage Manager. Multiple configurations of this solution are available. Front Line Manager, Manager, Supervisor,  English (USA),  Approximate Completion Time in minutes = 51 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Agency Manager Solution | SHL"},
{"name": "Administrative Professional - Short Form", "url": "https://www.shl.com/products/product-catalog/view/administrative-professional-short-form/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Administrative Professional solution is for entry to mid-level positions that involve routine clerical and administrative functions in addition to office management functions and customer service. Sample tasks for this job include, but are not limited to: arranging conference calls; drafting correspondence; scheduling meetings; greeting visitors; coordinating office activities. Potential job titles that use this solution are: Administrative Assistant, Secretary, Office Manager, Administrative Aide, and Administrative Associate. Entry-Level,  English (USA),  Approximate Completion Time in minutes = 36 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Administrative Professional - Short Form | SHL"},
{"name": "Account Manager Solution", "url": "https://www.shl.com/products/product-catalog/view/account-manager-solution/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. The Account Manager solution is an assessment used for job candidates applying to mid-level leadership positions that tend to manage the day-to-day operations and activities of client accounts. Sample tasks for these jobs include, but are not limited to: communicating with clients about project status, developing and maintaining project plans, coordinating internally with appropriate project personnel, and ensuring client expectations are being met. Potential job titles that use this solution are: Account Executive, Account Manager, and Senior Account Manager. There are multiple configurations of this solution available. Mid-Professional,  English (USA),  Approximate Completion Time in minutes = 49 \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English (USA) \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "Account Manager Solution  | SHL"},
{"name": "Talent Assessment | Recruitment Assessment Tool | SHL", "url": "https://www.shl.com/products/assessments/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n Evaluate job-related behaviors, skills, and competencies with patented assessments developed by our 300+ people scientists to hire high-quality talent. Our assessments provide actionable, timely insights to accelerate hiring while driving objectivity and fairness in your people decisions. SHL prioritizes candidate experiences to ensure you engage and excite candidates with interactive, realistic assessments and job simulations. Match each candidate’s behavioral fit with your role, to boost quality of hire and engagement. Our end-to-end digital assessment and development centers provide the most efficient and accurate way of identifying potential from anywhere in the world. Improve decisions with science-backed personality tests like OPQ that reveal individual preferences, motivations, and remote-work capability. Measure candidates’ potential to learn, adapt, and perform in any open role with Verify, the interactive cognitive assessment. Recruit top candidates at scale with skills assessments and simulation tests that measure practical application and knowledge. Identify best-fit candidates with focused, comprehensive online assessments that measure job-specific competencies. The Occupational Personality Questionnaire (OPQ) is SHL's flagship personality assessment, widely used to predict how a candidate's preferred personal style impacts their workplace behavior. It provides insights into an individual's potential by matching their preferences to role requirements and is backed by science with strong predictive accuracy. SHL's adherence to legal and scientific standards ensures that its assessments are developed and validated to be fair, reliable, and appropriate for their intended purposes in selection processes. The reliability of SHL assessments is reviewed during test development as well as a part of ongoing test maintenance practices. We document the reliability of our assessments (e.g., through test-retest and internal consistency methods) in our technical manuals. Psychometric assessments are standardized tests designed to assess candidates' cognitive abilities, personality traits, job-related skills and behavioral styles. They help organizations understand how candidates may perform in specific roles. SHL assessments are scientifically developed tools built on psychometric principles, ensuring they are reliable, valid, and suitable for making informed talent decisions. Psychometric assessments offer objective and reliable insights into candidates' individual differences such as skills, abilities, personality traits, and potential, enabling organizations to make informed talent decisions. They help ensure a strong fit for specific roles and promote fairness by reducing bias. When applied consistently throughout the talent lifecycle, these assessments provide valuable data for strategic talent decisions, enhancing organizational agility and maximizing workforce effectiveness. Yes, many providers, including SHL, can offer fully customizable assessments that align with your organization's specific competencies, values, and culture so that you get exactly what you need out of your talent processes. While AI-inferred talent data may offer some value, it is often less reliable and may introduce inaccuracies. Psychometric assessments, on the other hand, provide a more objective and scientifically validated understanding of what a candidate can do. In practice, AI-inferred data might be combined with psychometric data, but for robust and defensible decision-making, psychometric tools offer greater reliability and value. SHL's adherence to legal and scientific standards ensures that its assessments are developed and validated to be fair, reliable, and appropriate for their intended purposes in selection processes. Information and evidence regarding the content, construct, and criterion-related validity of our assessments is documented in our technical manuals. However, the validity of these assessments depends on their proper use, which is beyond our control. We advise users to adhere to best practices to ensure accurate and fair outcomes. SHL's adherence to legal and scientific standards ensures that its assessments are developed and validated to be fair, reliable, and appropriate for their intended purposes in selection processes. Our technical manuals summarize the analyses conducted to support the use of our assessments across and within protected groups. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Talent Assessment | Recruitment Assessment Tool | SHL"},
{"name": "SHL Cognitive Assessments", "url": "https://www.shl.com/products/assessments/cognitive-assessments/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n Measure potential to learn, adapt, and perform in any role with SHL Verify Interactive cognitive assessments. \n SHL Insights   \n Our pre-employment cognitive assessment starts by asking candidates a series of interactive questions organized around a central principle linked to something they are likely to encounter in the role. Measures  , or G, and effectively measures candidates’ problem-solving and critical reasoning capabilities. Measures candidates’ ability to draw logical conclusions and complete scenarios based on the information provided.   include reading statements, then determining which subsequent options cannot be true or must be true. Measures candidates’ ability to draw inferences from, and understand relationships between, various concepts.   include working out the pattern in a set of images and identifying the correct next image. Measures candidates’ ability to work with numbers and use appropriate mathematics in different situations.   include solving word problems, performing numerical calculations, and interpreting charts and graphs. SHL's Verify Interactive delivers precise scores indicating candidates' cognitive ability. These scores, along with other SHL talent acquisition data such as behavior and personality assessments, culminate in a well-rounded job score for each candidate. SHL's cognitive assessments aim to empower your teams to make fair and efficient talent choices, leading to business success. Head of Recruiting and HR Development Brüder Schlau Strengthen your workforce by converting diverse, top-quality graduates with meaningful hiring experiences, fair assessment tools and unrivalled science. Reboot your technology hiring process to draw in top-quality developers through immersive experiences and AI-powered virtual hiring tools. Help new and mid-level managers build leadership skills that boost team engagement and drive business results. Drive smarter talent mobility, succession planning, HIPO identification, and workforce development decisions with actionable talent insights. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Cognitive Ability Tests | Cognitive Assessments | SHL"},
{"name": "Situational Judgement Tests", "url": "https://www.shl.com/products/assessments/behavioral-assessments/situation-judgement-tests-sjt/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. SHL Behavioral Assessments \n SHL Insights Match candidates’ behavioral fit to your roles with a situational judgment test. These tests are typically administered early in the assessment process, they provide candidates with a fully-branded introduction to your business.   Candidates complete role and culture-based brief scenarios tailored to specific roles or drawn from SHL's bank for quick deployment. Our science evaluates each candidate's behavioral fit to your role using our  , the industry’s leading assessment of behavioral competency. Streamline candidate selection with Situational Judgement Tests (SJTs) for high-quality hires. SJTs are available within most SHL   solutions. Strengthen your workforce by converting diverse, top-quality graduates with meaningful hiring experiences, fair assessment tools and unrivalled science. Reboot your technology hiring process to draw in top-quality developers through immersive experiences and AI-powered virtual hiring tools. Help new and mid-level managers build leadership skills that boost team engagement and drive business results. Drive smarter talent mobility, succession planning, HIPO identification, and workforce development decisions with actionable talent insights. \n Delight candidates with a multimedia enabled and engaging and tailored assessment experience. \n Maximize the potential of your company’s greatest asset—your people. SHL and its affiliates. All rights reserved.", "title": "Situational Judgment Tests (SJT) | SHL"},
{"name": "SHL Motivational Questionnaire", "url": "https://www.shl.com/products/assessments/personality-assessment/shl-motivation-questionnaire-mq/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. SHL Personality Assessments \n SHL Insights Understand what motivates your workforce and how to activate that knowledge. SHL’s Motivational Questionnaire provides specific insights that facilitate the best talent decisions. Participants rate a series of situations or conditions, deciding how each would affect their motivation to work. SHL utilizes the insights from the MQ to match the candidate with a tailored profile, leveraging our extensive expertise and considering your hiring or development needs. The motivation assessment scores are then delivered to your teams, directly integrated within your SHL   or   solution. The Motivation Questionnaire is available on the SHL platform and powers both SHL Talent Acquisition and Talent Management solutions. Discover how we can transform your talent decisions today. Strengthen your workforce by converting diverse, top-quality graduates with meaningful hiring experiences, fair assessment tools and unrivalled science. Reboot your technology hiring process to draw in top-quality developers through immersive experiences and AI-powered virtual hiring tools. Help new and mid-level managers build leadership skills that boost team engagement and drive business results. Drive smarter talent mobility, succession planning, HIPO identification, and workforce development decisions with actionable talent insights. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "Motivation Questionnaire | Motivation Assessment Test | SHL"},
{"name": "Skills Assessments that Predict On-the-job Success", "url": "https://www.shl.com/products/assessments/job-focused-assessments/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. Job-Focused Assessments \n SHL’s Job-Focused Assessments predict job success by evaluating key hard and soft skills tailored to specific roles. Applicants take a short, engaging assessment relevant to the job and you gain a comprehensive view of candidates' role readiness, team fit and future potential. \n Fast and accurate measurement of job-relevant skills using patented Apta technology.   Get a well-rounded view of each candidate’s level of potential, readiness, and fit through one single assessment. Job-Focused Assessments utilize Apta, a direct measure of observable competency behaviors linked to performance, which has been proven to reduce faking and impression management. Attract best-fit talent with skills assessments that are directly related to the role they are applying for. Measure the skills and competencies that matter most to any specific job or role level. Pre-packaged assessments to ensure quick deployment. Select candidates based on the skills they possess or ability and desire to grow, without relying on past experience and formal qualifications. \n Unlock the full potential of your hiring process through SHL’s hiring solution packages, which all include job-focused assessments. Evaluate the essential skills for any role and beyond, while providing candidates with a memorable and intuitive experience. Identify candidates who excel in delivering exceptional customer service and issue resolution. Spot candidates who meet high customer expectations and thrive in uncertain environments. Find top talent for roles that demand high-quality, safe, and reliable work. Select candidates with the ability to learn quickly to build a future-ready talent pipeline. Evaluate today’s critical and measure reskilling potential across various individual contributor roles. Identify managerial skills, potential, and reskilling ability to support the ever-changing demands of people management. \n Companies using SHL’s Job-Focused Assessments report significant improvements. 40% less likely to hire tardy production workers 40% more likely to acquire new customers through contact center agents 73% more capable of handling difficult customers through service reps  66% more likely to achieve top sales performance ratings \n Objectively measure the right skills across your recruitment process, whatever the role. SHL and its affiliates. All rights reserved.", "title": "Job-Focused Assessments | Skills Assessments | SHL"},
{"name": "SHL Occupational Personality Questionnaire OPQ | SHL", "url": "https://www.shl.com/products/assessments/personality-assessment/shl-occupational-personality-questionnaire-opq/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. \n SHL Insights Gain accurate, Insightful assessment of employee potential with SHL’s Occupational Personality Questionnaire. The OPQ helps you make more informed talent decisions. Participants answer questions about their working preferences to identify their strengths and areas for development within the universal competency framework. SHL quickly and reliably matches this understanding to a scientifically chosen profile, tailored to meet your hiring or development needs. Hiring managers receive a report on each candidate's fit, potential, and development gaps, integrated with SHL   or   solutions and your company’s existing applicant tracking system. The Adecco Group The OPQ is available on the SHL platform and powers both Talent Acquisition and Talent Management solutions. Discover how we can transform your talent decisions today.  Strengthen your workforce by converting diverse, top-quality graduates with meaningful hiring experiences, fair assessment tools and unrivalled science. Reboot your technology hiring process to draw in top-quality developers through immersive experiences and AI-powered virtual hiring tools. Help new and mid-level managers build leadership skills that boost team engagement and drive business results. Drive smarter talent mobility, succession planning, HIPO identification, and workforce development decisions with actionable talent insights. \n   With our platform of pre-configured talent acquisition and talent management solutions, maximize the potential of your company’s greatest asset—your people. \n\n SHL and its affiliates. All rights reserved.", "title": "SHL Occupational Personality Questionnaire OPQ | SHL"},
{"name": "HiPo Unlocking Potential Report 2.0", "url": "https://www.shl.com/products/product-catalog/view/hipo-unlocking-potential-report-2-0/", "description": "We recommend upgrading to a modern browser. If you choose to continue with your current browser we cannot guarantee your experience. This report draws insights from the Occupational Personality QuestionnaireTM (OPQ32). Used for individuals who are selected into a client’s HiPo program, it provides a detailed analysis of managerial and leadership potential. \n                                    Test Type:\n                                     \n                                 \n                                        Remote Testing:  \n                                     \n                                                 \n                                             English International \n                                                 \n                                             Latin American Spanish \n                                                 \n                                             English (USA) \n                                                 \n                                             French \n                                                 \n                                             German \n                                                 \n                                             Italian \n                                                 \n                                             Thai \n Speak to our team today to see how our products transform talent strategy. SHL and its affiliates. All rights reserved.", "title": "HiPo Unlocking Potential Report 2.0 | SHL"}
]